Tekla Open API Reference for Tekla Structures 2025
StructuresDialogFilterAttribute Methods
The StructuresDialogFilterAttribute type exposes the following members.
Methods
Name | Description
ToString
 Returns a string that represents the current StructuresDialogFilterAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
StructuresDialogFilterAttribute Class
Tekla.Structures.Dialog Namespace